{
  "global": {
    "title": "شجرة العائلة",
    "home": "الصفحة الرئيسية",
    "about": "عن الموقع",
    "login": "تسجيل الدخول",
    "logout": "تسجيل الخروج",
    "familyTrees": "إدارة شجرات العائلة",
    "confirm": "تأكيد",
    "cancel": "إلغاء",
    "selectFamilyTree": "أختر شجرة",
    "select": "أختر",
    "profile": "الملف الشخصي",
    "numberOfFamilyTree": "عدد الشجرات",
    "numberOfOwnedFamilyTree": "عدد الشجرات المملوكة",
    "language": "اللغة",
    "arabic": "العربية",
    "english": "English",
    "statistics": "الإحصائيات",
    "numberOfRecords": "عدد {{fieldName}}",
    "privacyPolicy": "سياسة الخصوصية",
    "contactUs": "اتصل بنا",
    "termsAndConditions": "الشروط والأحكام",
    "aboutUs": "عن الموقع",
    "copyright": "جميع الحقوق محفوظة 2022©",
    "back": "عودة",
    "viewFamilyTree": "شجرات العوائل",
    "message": {
      "noData": "لا يوجد بيانات",
      "confirmHeader": "تأكيد",
      "successfullyAdded": "تمت الإضافة بنجاح",
      "successfullyEdited": "تم التعديل بنجاح",
      "successfullyUpdated": "تم التحديث بنجاح",
      "successfullyRemoved": "تم الحذف بنجاح",
      "successfullyCancelled": "تم الإلغاء بنجاح",
      "error": {
        "internalServerError": "حدث خطأ ما، الرجاء المحاولة مرة أخرى.",
        "required": "الرجاء إدخال {{ fieldName }}",
        "requiredSelect": "الرجاء اختيار {{ fieldName }}",
        "pattern": "الرجاء إدخال {{ fieldName }} بشكل صحيح",
        "namePattern": "يجب أن يكون طول {{ fieldName }} أقل من 15 حرفاً",
        "passwordLength": "طول كلمة المرور يجب أن يكون من 8 إلى 50 حرفاً",
        "passwordPattern": "كلمة المرور يجب أن تحتوي على أكثر من حرف كبير وصغير وأرقام",
        "requiredTrue": "يجب الموافقة على الشروط والأحكام"
      }
    },
    "contactUsDetails": {
      "title": "اتصل بنا",
      "message": "نسعد بتواصلكم معنا عن طريق القنوات التالية",
      "email": "البريد الإلكتروني",
      "twitter": "تويتر"
    },
    "privacyPolicyDetails": {
      "title": "سياسة الخصوصية",
      "1.1": "تبين سياسة الخصوصية طريقة التعامل مع بيانات المستخدمين من جمعها وحفظها ومشاركتها مع الغير، والهدف من ذكرها هو تبيين طريقتنا بالتعامل مع بياناتك ومعلوماتك وحرصنا على سريتها، واستخدامك للمنصة يمثل موافقتك على هذه السياسة وأي تعديل يطرأ عليها.",
      "1.2": "سياسة الخصوصية تعد اتفاقية ملزمة قانونياً بين جميع الأطراف ذات العلاقة.",
      "1.3": "نمتلك الحق الكامل في تحديث سياسة الخصوصية هذه سواء بإضافة أو حذف بنود جديدة أو بتعديل بنود حالية في أي وقت. ",
      "savedInfo": "المعلومات التي نحفظها:",
      "2.1": "المعلومات الشخصية الخاصة بك، كالاسم والبريد الإلكتروني، ومعلومات الدخول الشخصية.",
      "2.2": "جميع البيانات المدخلة من قبلكم في النظام.",
      "2.3": "بيانات استخدامك للمنصة وأوقات دخولك إلى حسابك، يشمل ذلك معلومات حول الجهاز المستخدم والمتصفح الذي تستخدمه وعنوان بروتوكول الإنترنت، وذلك لغرض دراسة المستخدمين وتحسين المنصة.",
      "2.4": "استخدام ملفات تعريف الارتباط ووسائل الحفظ المتوفرة للتعرف على جهاز المستخدم لتزويده بتجربة شخصية، والاستفادة منها.",
      "2.5": "استخدام أساليب التتبع المتوفرة لقياس الأداء وتسهيل عمليات الدعم الفني عند الحاجة لذلك.",
      "sharingInfo": "مشاركة المعلومات:",
      "3.start": "نسعى في المنصة على سرية معلومات وبيانات المستخدمين، ولن نقوم بمشاركة البيانات إلا لما يتطلب مشاركته لتقديم خدمة من طرف ثالث مع ضمان تمتع الأطراف الأخرى بذات سياسة الخصوصية، وهي كالآتي:",
      "3.1": "سيتم مشاركة اسمك وبريدك الإلكتروني مع طرف ثالث يقدم خدمات الدفع الإلكتروني.",
      "security": "مدى أمان سرية المعلومات:",
      "4.start": "نسعى في المنصة لاتخاذ إجراءات الحماية المتنوعة للمحافظة على سرية المعلومات وتحديثها بشكل دائم، ولكن لا يمكن لأي نظام أو تقنية أن تبقى في مأمن تام، إذا شعرت بحدوث تسريب أو وجدت أي ثغرة الرجاء التواصل معنا للعمل على حل المشكلة."
    },
    "termsAndConditionsDetails": {
      "title": "الشروط والأحكام",
      "start": "يقتضي التسجيل في الموقع الموافقة على الشروط والأحكام أدناه والموافقة على ذلك يعتبر إقرار منك بدون أي اعتراض. ",
      "definitions": "تعريفات:",
      "1.1": "المنصة: يقصد بها منصة شجرة العائلة بجميع أشكالها، من موقع أو تطبيق أو أي شيء آخر.",
      "1.2": "المستخدم: الأفراد أو الجهات الذين قاموا بالتسجيل في المنصة.",
      "1.3": "الطرف الثالث: يقصد به أي أفراد أو جهات أخرى غير المنصة أو المستخدم.",
      "1.4": "رسوم الاشتراك: المبالغ المالية المدفوعة للمنصة نظير استخدامها.",
      "1.5": "الرسوم الإضافية: جميع المبالغ المالية المستحقة لجهات أخرى والمفروضة على الخدمات التي تقدمها المنصة.",
      "accountTerms": "شروط الحساب:",
      "2.1": "للاستفادة من خدمات المنصة، يتوجب عليك التسجيل وتقديم جميع البيانات المطلوبة لذلك، ويحق للمنصة إلغاء أي حساب لأي سبب وفقاً للصلاحيات الممنوحة لإدارة المنصة.",
      "2.2": "يحق للمنصة استخدام عنوان البريد الإلكتروني باعتباره وسيلة أساسية للتواصل.",
      "2.3": "يجب على المستخدم المحافظة على كلمة المرور الخاصة به، كما أن المنصة غير مسؤولة عن أي خسارة أو ضرر يقع نتيجة للنسيان وعدم الحفاظ على اسم الحساب وكلمة المرور.",
      "deleteAccount": "حذف الحساب:",
      "3.start": "إذا قامت المنصة أو المستخدم بإلغاء وحذف لأي سبب من الأسباب، فإن للمنصة الحق بالآتي:",
      "3.1": "سوف تتوقف المنصة عن تزويد المستخدم بالخدمات ولن يتمكن بعد ذلك من الدخول إلى حسابه.",
      "3.2": "لا يملك المستخدم الحق في استرداد أي رسوم.",
      "3.3": "تحتفظ المنصة بكامل الأحقية في استخدام أو تعديل البيانات المسجلة في حساب المستخدم ما عدا بياناته المالية لأي سبب من الأسباب في أي وقت وبدون إشعار حتى بعد إلغاء حسابه في المنصة.",
      "priceAndServices": "   الأسعار والخدمات:",
      "4.1": "تلتزم المنصة بتقديم الخدمة النهائية للعميل طوال مدة اشتراكه.",
      "4.2": "يحق للمنصة التعديل على خدماتها بأي شكل تراه، ولا تلتزم بطريقة محددة لتقديم الخدمات.",
      "4.3": "يحق للمنصة إضافة خدمات جديدة وتعديل طريقة استخدام أي خدمة حالية.",
      "4.4": "أسعار الاشتراك في الخدمات غير ثابتة وقابلة للتغيير في أي وقت، وتعتبر سارية المفعول عند نشرها على المنصة.",
      "4.5": "الاشتراكات القائمة لن تخضع لتغيرات الأسعار، ولكن ستطبق عند ترقية وتجديد الاشتراكات.",
      "4.6": "لا يحق للمستخدم المطالبة بالتعويض أو استرداد المبالغ المتبقية للاشتراك في حالة إلغائه.",
      "4.7": "لا يحق للمستخدم المطالبة بالتعويض أو استرداد المبالغ عند تخفيض أسعار الاشتراكات.",
      "4.8": "يتحمل المستخدم جميع الآثار على إلغاء اشتراكه ولا يحق له المطالبة بإعادة تفعيله.",
      "responsibility": "حدود المسئولية:",
      "5.1": "المنصة غير مسؤولة عن أي ضرر مباشر أو غير مباشر الناتجة من استخدام الخدمة أو عدم القدرة على ذلك.",
      "5.2": "المنصة غير مسؤولة عن أي فقدان للأرباح أو أي خسارة ناتجة عن الاعتماد على المنصة أو استخدامها.",
      "5.3": "يتحمل المستخدم كامل المسؤولية عن استخدام الخدمات المقدمة من المنصة، ويقر بذلك دون أي ضمان، أو شروط صريحة، أو ضمنية، أو قانونية.",
      "5.4": "المنصة لا تضمن عند وقوع أي خلل في تقديم الخدمات خارج عن قدرتها أو بسبب ظروف طارئة أو قاهرة أي مسؤولية، وتلتزم المنصة باتخاذ كافة الخطوات اللازمة والمعقولة للمعالجة.",
      "general": "أحكام عامة:",
      "6.1": "ستكون شروط الاستخدام متاحة باللغة العربية فقط.",
      "6.2": "يجب أن تقرأ جميع الشروط والأحكام الواردة في شروط الاستخدام وسياسة الخصوصية وأن توافق عليها وتقبلها قبل التسجيل في المنصة.",
      "6.3": "تخضع شروط الاستخدام وتطبق بشأنها الأنظمة المعمول بها في المملكة العربية السعودية، ويتفق المستخدم على انعقاد الاختصاص في حال نشوب نزاع في الفصل به إلى الأنظمة القضائية بالمملكة العربية السعودية.",
      "6.4": "يقر صاحب الحساب بموافقته على أن المنصة قد تعدل شروط الاستخدام هذه في أي وقت عن طريق نشر شروط الاستخدام المعدلة على موقع المنصة أو التطبيق.",
      "6.5": "تسري التعديلات على شروط الاستخدام اعتبارًا من تاريخ النشر، وعليه فإن استخدام صاحب الحساب للخدمات بعد التعديل الذي يطرأ عليها والذي يتم نشره على موقع المنصة أو التطبيق يعتبر موافقة على شروط الاستخدام المعدلة وقبول بها، ويجب على المستخدم التوقف عن استخدام الخدمة في حال عدم موافقته على أي تغييرات في شروط الاستخدام.",
      "6.6": "لا يجوز لصاحب الحساب استخدام الخدمات المقدمة من المنصة لأي غرض غير قانوني أو نظامي، أو لأي غرض غير مصرح به، ولا يحق له استخدام الخدمة بأي شكل يمثل انتهاكاً لأي نظام أو قانون سار في المملكة العربية السعودية، خاصة قوانين حق المؤلف وحقوق الملكية الفكرية، ويحق للمنصة إبطال أي حساب ينتهك أيًا مما سبق.",
      "6.7": "يقر المستخدم بأن لا يعيد إنتاج، أو تكرار، أو نسخ، أو بيع، أو إعادة بيع، أو استغلال أي جزء من خدمات المنصة، أو استخدامها، أو الوصول إليها دون الحصول على إذن كتابي صريح من المنصة.",
      "6.8": "جميع حقوق المنصة محفوظة لصالح ناشرها."
    },
    "aboutUsDetails": {
      "title": "عن الموقع",
      "start": "نقوم بحفظ وعرض شجرة العائلة، لكي تتمكن من مشاركتها مع من تحب.",
      "services": "الخدمات المقدمة:",
      "2.1": "إنشاء شجرة عائلة وإضافة المنتسبين لها.",
      "2.2": "عرض الشجرة بطريقة مناسبة.",
      "2.3": "تمكين المستخدم من مشاركة الشجرة مع من يحب.",
      "2.4": "إضافة مستخدمين للشجرة بمختلف الصلاحيات."
    },
    "pricingDetails": {
      "title": "الباقات",
      "start": "تقسم الباقات على حسب عدد الأشخاص في الشجرة، جميع الباقات مدتها سنة كاملة، الباقات وأسعارها كالآتي:",
      "from": "من",
      "to": "إلى",
      "person": "شخص",
      "cost": "قيمتها",
      "riyal": "ريال"
    }
  }
}
